MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmWrite/RovePwmWrite_TivaTM4C1294NCPDT.cpp
//returns the GPIO port peripheral const used by the mapped pin
static uint32_t pinMapToPinPortPeriph[] =
{
    0,   // dummy
    0,   // 01 - 3.3v       X8_01
    0,   // 02 - PE_4       X8_03
    0,   // 03 - PC_4       X8_05
    0,   // 04 - PC_5       X8_07
    0,   // 05 - PC_6       X8_09
    0,   // 06 - PE_5       X8_11
    0,   // 07 - PD_3       X8_13
    0,   // 08 - PC_7       X8_15
    0,   // 09 - PB_2       X8_17
    0,   // 10 - PB_3       X8_19
    0,   // 11 - PP_2       X9_20
    0,   // 12 - PN_3       X9_18
    0,   // 13 - PN_2       X9_16
    0,   // 14 - PD_0       X9_14
    0,   // 15 - PD_1       X9_12
    0,   // 16 - RST        X9_10
    0,   // 17 - PH_3       X9_08
    0,   // 18 - PH_2       X9_06
    0,   // 19 - PM_3       X9_04
    0,   // 20 - GND        X9_02
    0,   // 21 - 5v         X8_02
    0,   // 22 - GND        X8_04
    0,   // 23 - PE_0       X8_06
    0,   // 24 - PE_1       X8_08
    0,   // 25 - PE_2       X8_10
    0,   // 26 - PE_3       X8_12
    0,   // 27 - PD_7       X8_14
    0,   // 28 - PA_6       X8_16
    0,   // 29 - PM_4       X8_18
    0,   // 30 - PM_5       X8_20
    0,   // 31 - PL_3       X9_19
    0,   // 32 - PL_2       X9_17
    0,   // 33 - PL_1       X9_15
    0,   // 34 - PL_0       X9_13
    0,   // 35 - PL_5       X9_11
    0,   // 36 - PL_4       X9_09
    SYSCTL_PERIPH_GPIOG,   // 37 - PG_0       X9_07
    SYSCTL_PERIPH_GPIOF,   // 38 - PF_3       X9_05
    SYSCTL_PERIPH_GPIOF,   // 39 - PF_2       X9_03
    SYSCTL_PERIPH_GPIOF,   // 40 - PF_1       X9_01
    0,   // 41 - 3.3v       X6_01
    0,   // 42 - PD_2       X6_03
    0,   // 43 - PP_0       X6_05
    0,   // 44 - PP_1       X6_07
    0,   // 45 - PD_4       X6_09
    0,   // 46 - PD_5       X6_11
    0,   // 47 - PQ_0       X6_13
    0,   // 48 - PP_4       X6_15
    0,   // 49 - PN_5       X6_17
    0,   // 50 - PN_4       X6_19
    0,   // 51 - PM_6       X7_20
    0,   // 52 - PQ_1       X7_18
    0,   // 53 - PP_3       X7_16
    0,   // 54 - PQ_3       X7_14
    0,   // 55 - PQ_2       X7_12
    0,   // 56 - RESET      X7_10
    0,   // 57 - PA_7       X7_08
    0,   // 58 - PP_5       X7_06
    0,   // 59 - PM_7       X7_04
    0,   // 60 - GND        X7_02
    0,   // 61 - 5v         X6_02
    0,   // 62 - GND        X6_04
    0,   // 63 - PB_4       X6_06
    0,   // 64 - PB_5       X6_08
    0,   // 65 - PK_0       X6_10
    0,   // 66 - PK_1       X6_12
    0,   // 67 - PK_2       X6_14
    0,   // 68 - PK_3       X6_16
    0,   // 69 - PA_4       X6_18
    0,   // 70 - PA_5       X6_20
    0,   // 71 - PK_7       X7_19
    0,   // 72 - PK_6       X7_17
    0,   // 73 - PH_1       X7_15
    0,   // 74 - PH_0       X7_13
    0,   // 75 - PM_2       X7_11
    0,   // 76 - PM_1       X7_09
    0,   // 77 - PM_0       X7_07
    SYSCTL_PERIPH_GPIOK,   // 78 - PK_5       X7_05
    SYSCTL_PERIPH_GPIOK,   // 79 - PK_4       X7_03
    SYSCTL_PERIPH_GPIOG,   // 80 - PG_1       X7_01
    0,   // 81 - PN_1       LED1
    0,   // 82 - PN_0       LED2
    0,   // 83 - PF_4       LED3
    SYSCTL_PERIPH_GPIOF,   // 84 - PF_0       LED4
    0,   // 85 - PJ_0       USR_SW1
    0,   // 86 - PJ_1       USR_SW2
    0,   // 87 - PD_6       AIN5
    0,   // 88 - PA_0       JP4
    0,   // 89 - PA_1       JP5
    0,   // 90 - PA_2       X11_06
    0,   // 91 - PA_3       X11_08
    0,   // 92 - PL_6       unrouted
    0,   // 93 - PL_7       unrouted
    0,   // 94 - PB_0       X11_58
    0,   // 95 - PB_1       unrouted
};

uint32_t setupPwmClock(long f_cpu);

//the base address and peripheral address for the PWM module
//hard coded since there is only one module
static const uint32_t PWMBase = PWM0_BASE;
static const uint32_t PWMPeriph = SYSCTL_PERIPH_PWM0;

//Desired pwm clock at about 1.875 Mhz; that's the lowest value we can set it that still
//gets us 1 microseconds of accuracy when the system clock is at its max of 120Mhz, which most people will probably be using and as
//such is the minimum value we can possibly get it without breaking at 120Mhz while still having that 1 microsecond of accuracy
//The pwm clock is based on the system clock divided by some value of 2^n from 64 to 1
const uint32_t PWM_CLOCK_DESIRED_FREQ = 1875000;

//accesses the GPIO Port periph constant for the specified mapped pin and returns by reference.
//returns false if invalid pin
static bool getPortPeriph(uint32_t &portPeriph, uint8_t pin)
{
  if(pinMapToPinPortPeriph[pin] == 0)
    return false;
  portPeriph = pinMapToPinPortPeriph[pin];
  return true;
}

//accesses the GPIO pin mask for the specified mapped pin and returns by reference.
//returns false if invalid pin
static bool getGPIOPinMask(uint8_t &pinMask, uint8_t pin)
{
  if(pinMapToGPIOPinMask[pin] == 0)
    return false;
  pinMask = pinMapToGPIOPinMask[pin];
  return true;
}

//accesses the GPIO Port base constant for the specified mapped pin and returns by reference.
//returns false if invalid pin
static bool getGPIOPortBase(uint32_t &portBase, uint8_t pin)
{
  if(pinMapToGPIOPortBase[pin] == 0)
    return false;
  portBase = pinMapToGPIOPortBase[pin];
  return true;
}

//accesses the pwm pin config constant (the one used by the GPIOPinConfigure function) for the specified mapped pin and returns by reference.
//returns false if invalid pin
static bool getPwmPinConfig(uint32_t &pinConfigConst, uint8_t pin)
{
  if(pinMapToPwmPinConfig[pin] == 0)
    return false;
  pinConfigConst = pinMapToPwmPinConfig[pin];
  return true;
}

//accesses the PWM generator constant for the specified mapped pin and returns by reference.
//returns false if invalid pin
static bool getPwmGen(uint32_t &gen, uint8_t pin)
{
  if(pinMapToPwmGen[pin] == 0)
    return false;
  gen = pinMapToPwmGen[pin];
  return true;
}

//accesses the pwm pin offset constant for the specified mapped pin and returns by reference.
//returns false if invalid pin
static bool getPwmPin(uint32_t &PwmPin, uint8_t pin)
{
  if(pinMapToPWMPin[pin] == 0)
    return false;
  PwmPin = pinMapToPWMPin[pin];
  return true;
}

