MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmWrite/RovePwmWrite_TivaTM4C1294NCPDT.cpp
//accesses the bitwise pwm pin constant for the specified mapped pin and returns by reference.
//returns false if invalid pin
bool getPwmPinBit(uint32_t &PwmPinBit, uint8_t pin)
{
  if(pinMapToPWMPinBit[pin] == 0)
    return false;

  PwmPinBit = pinMapToPWMPinBit[pin];
  return true;
}

//accesses the look up table for the alignment, converting the enum to the desired uint32_t value
static void getAlignment(uint32_t &alignment, pwmAlignment align)
{
  alignment = pinMapToAlignment[align];
  return;
}

static PwmModuleData* getPwmModule(uint16_t moduleIndex)
{
  PwmModuleData* module = 0;
  switch(moduleIndex)
  {
    case 0:
      module = &mod0Data;
      break;

    case 1:
      module = &mod1Data;
      break;

    case 2:
      module = &mod2Data;
      break;

    case 3:
      module = &mod3Data;
      break;
  }

  return module;
}

bool validateInput(uint8_t writeModule, uint8_t pin)
{
  switch(writeModule)
  {
    case 0:
      if(pin == PF_0 || pin == PF_1)
      {
        return true;
      }
      break;

    case 1:
      if(pin == PF_2 || pin == PF_3)
      {
        return true;
      }
      break;

    case 2:
      if(pin == PG_0 || pin == PG_1)
      {
        return true;
      }
      break;

    case 3:
      if(pin == PK_4 || pin == PK_5)
      {
        return true;
      }
      break;
  }

  return false;
}

RovePwmWrite_Handle setupPwmWrite(uint8_t writeModule, uint8_t pin)
{
  uint32_t gpioConfigConst, gen, pulseP_Ticks, PulsePeriod_us;
  RovePwmWrite_Handle handle;
  PwmModuleData* moduleData = getPwmModule(writeModule);

  if(pin > 95)
  {
    debugFault("setupPwmWrite: pin value is nonsense");
  }
  else if (writeModule > 4)
  {
    debugFault("setupPwmWrite: writeModule value is nonsense");
  }
  else if(validateInput(writeModule, pin) == false)
  {
    debugFault("setupPwmWrite: module doesn't fit pin");
  }

  if(moduleData->setup == false)
  {
    getPwmPinConfig(gpioConfigConst, pin);
    getPwmGen(gen, pin);

    //Enable PWM module
    SysCtlPeripheralEnable(PWMPeriph);
    while(!SysCtlPeripheralReady(PWMPeriph));

    //setup pwm clock, and calculate the period and pulse width values in ticks based off of
    //the calculated pwm clock
    moduleData->f_cpuAdjusted = setupPwmClock(getCpuClockFreq());
    PulsePeriod_us = (1.0/DEFAULT_WAVE_FREQ) * 1000000.0; //1/wavePeriod_hz = wavePeriod_s
    pulseP_Ticks = moduleData->f_cpuAdjusted * (PulsePeriod_us/1000000.0); // Freq * totalPulsePeriod_s = SysFreq * (totalPulsePeriod_us / 1,000,000) = (system ticks/second) * ( totalPulsePeriod_seconds) = ticks needed

    //Configure Generator no sync and no gen sync, no Deadband sync, and sets the alignment for the generator
    PWMGenConfigure(PWMBase, gen, PWM_GEN_MODE_NO_SYNC | PWM_GEN_MODE_DOWN);

    //disable the dead band
    PWMDeadBandDisable(PWMBase, gen);

    //Set default period
    PWMGenPeriodSet(PWMBase, gen, pulseP_Ticks);

    //Enable generator
    PWMGenEnable(PWMBase, gen);

    moduleData->setup = true;
    moduleData->pulseTotalPeriod_us = PulsePeriod_us;
  }

  handle.initialized = true;
  handle.index = writeModule;
  handle.pin = pin;

  return handle;
}

void pwmWriteDuty(RovePwmWrite_Handle handle, uint8_t duty)
{
  uint32_t pulseW_us;
  uint32_t wavePeriod_us;
  float percentDuty;
  PwmModuleData* moduleData;

  if(handle.initialized == false)
  {
    debugFault("pwmWriteDuty: handle not initialized");
  }

  moduleData = getPwmModule(handle.index);

  percentDuty = (float)duty/255.0; //0-255 is input for duty, being 8 bit
  wavePeriod_us = moduleData->pulseTotalPeriod_us;

  //get the microseconds that the pulse is high, which is duty percentage * wavePeriod_us
  //since duty percentage = (on period_us / wavePeriod_us)
  pulseW_us = (percentDuty * (float)wavePeriod_us);

  pwmWriteWidth(handle, pulseW_us);
}

void pwmWriteWidth(RovePwmWrite_Handle handle, uint32_t pulseW_us)
{
  uint32_t gpioPortBase, gpioPortPeriph, gpioConfigConst, gen, pwmPin, pwmPinBit, pulseW_Ticks;
  uint8_t pinMask;
  uint8_t pin = handle.pin;
  PwmModuleData * moduleData;

  if(handle.initialized == false)
  {
    debugFault("pwmWriteWidth: handle not initialized");
  }

  getPortPeriph(gpioPortPeriph, pin);
  getGPIOPinMask(pinMask, pin);
  getGPIOPortBase(gpioPortBase, pin);
  getPwmPinConfig(gpioConfigConst, pin);
  getPwmGen(gen, pin);
  getPwmPin(pwmPin, pin);
  getPwmPinBit(pwmPinBit, pin);
  moduleData = getPwmModule(handle.index);

  //if the pulse width is larger than or equal to the pulse period then disable PWM output, set GPIO pin to output and write 1 to pin.
  if(pulseW_us >= moduleData->pulseTotalPeriod_us)
  {
    PWMOutputState(PWMBase, pwmPinBit, false);
    GPIOPinTypeGPIOOutput(gpioPortBase, pinMask);
    GPIOPinWrite(gpioPortBase, pinMask, pinMask);
  }

  //if pulse width is 0 or less disable the PWM out set GPIO to output and write 0 to pin
  else if(pulseW_us <= 0)
  {
    PWMOutputState(PWMBase, pwmPinBit, false);
    GPIOPinTypeGPIOOutput(gpioPortBase, pinMask);
    GPIOPinWrite(gpioPortBase, pinMask, 0);
  }

  //actually use PWM
  else
  {
    //Set the GPIO pin to Periphial Port Type PWM
    //and configure it
    GPIOPinTypePWM(gpioPortBase, pinMask);
    GPIOPinConfigure(gpioConfigConst);

    //calculate the pulse width values in ticks based off the pwm clock
    pulseW_Ticks = moduleData->f_cpuAdjusted * (pulseW_us/1000000.0);

    //Set Pulse width
    PWMPulseWidthSet(PWMBase, pwmPin, pulseW_Ticks);

    //Enable Output
    PWMOutputState(PWMBase, pwmPinBit, true);
  }
}

void setPwmTotalPeriod(RovePwmWrite_Handle handle, uint32_t pulsePeriod_us)
{
  uint32_t gen, pulseP_Ticks;
  PwmModuleData * moduleData;

  if(handle.initialized == false)
  {
   debugFault("setPwmPeriod: handle not initialized");
  }

  getPwmGen(gen, handle.pin);
  moduleData = getPwmModule(handle.index);

  pulseP_Ticks = moduleData->f_cpuAdjusted * (pulsePeriod_us/1000000.0); // Freq * totalPulsePeriod_s = SysFreq * (totalPulsePeriod_us / 1,000,000) = (system ticks/second) * ( totalPulsePeriod_seconds) = ticks needed

