MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmWrite/RovePwmWrite_TivaTM4C1294NCPDT.cpp
  //Set period
  PWMGenPeriodSet(PWMBase, gen, pulseP_Ticks);

  moduleData->pulseTotalPeriod_us = pulsePeriod_us;
}

void setPwmAlignment(RovePwmWrite_Handle handle, pwmAlignment alignment)
{
  uint32_t gen, alignValue;
  if(handle.initialized == false)
  {
   debugFault("setPwmAlignment: handle not initialized");
  }

  getPwmGen(gen, handle.pin);
  getAlignment(alignValue, alignment);

  //Configure Generator no sync and no gen sync, no Deadband sync, and sets the alignment for the generator
  PWMGenConfigure(PWMBase, gen, PWM_GEN_MODE_NO_SYNC | alignValue);
}

void setPwmInvert(RovePwmWrite_Handle handle, bool invertOutput)
{
  uint32_t gen, pwmPinBit;

  if(handle.initialized == false)
  {
   debugFault("setPwmAlignment: handle not initialized");
  }

  getPwmGen(gen, handle.pin);
  getPwmPinBit(pwmPinBit, handle.pin);

  //output Invert if needed
  PWMOutputInvert(PWMBase, pwmPinBit, invertOutput);
}

//configures the pwm clock source for operation. 
//input: frequency of the main system clock in hz, which for the tm4c1294 is max at 120Mhz. Min for this library is 1.875 Mhz
//returns: the frequency of the pwm clock, for calculating pwm loads
uint32_t setupPwmClock(long f_cpu)
{
  uint32_t clockDivisor;
  uint32_t f_cpuAdjusted;

  //try to get the pwm clock as close to the desired freq as possible. 
  //We can only change the clock by dividing the system clock by 2^n 1-64, so we have to 
  //simply get it as close as possible. 
  //Deliberately put into ascending order, starting at the lowest value we can get and going up
  if((f_cpu / 64) >=PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_64;
    f_cpuAdjusted = (f_cpu / 64);
  }
  else if((f_cpu / 32) >=PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_32;
    f_cpuAdjusted = (f_cpu / 32);
  }
  else if((f_cpu / 16) >=PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_16;
    f_cpuAdjusted = (f_cpu / 16);
  }
  else if((f_cpu / 8) >=PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_8;
    f_cpuAdjusted = (f_cpu / 8);
  }
  else if((f_cpu / 4) >=PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_4;
    f_cpuAdjusted = (f_cpu / 4);
  }
  else if((f_cpu / 2) >=PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_2;
    f_cpuAdjusted = (f_cpu / 2);
  }
  else if(f_cpu >= PWM_CLOCK_DESIRED_FREQ)
  {
    clockDivisor = PWM_SYSCLK_DIV_1;
    f_cpuAdjusted = (f_cpu);
  }
  else
  {
    return 0; //f_cpu is too damn small
  }

  PWMClockSet(PWM0_BASE, clockDivisor);
  return(f_cpuAdjusted);
}


